// 027_PrintfEx.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

// const 
// 랜덤
// 숙제 git주소를 줘야 한다.
// 대부분이 실습 위주로 갈거고요.
// 저는 여러분들이 도움을 요청하지 않으면 철저하게 무시한다.
// 절대 먼저 간섭하지 않는다.
// 제가 공언한 내용을 제외하고.
// 어떤일은 제가 먼저 이야기하면 그 사람걸 보겠다.
// => 일반적으로 게임개발에서 논리적으로 박살날 준비가 되어어야 합니다.
// 말하면 무조건 무조건 간섭합니다. 자신이 원하는 수준이 간섭
// 포폴기간 한명이 계속 질문합니다.
// 전부다 공식적인 테스트 제외하고 전부다 거부가능.
// 최종 테스트는 서로간에 팀작업 제외하고는 공개되지 않아요.


int main()
{
    printf_s("printf는 포매팅을 통해서 숫자도 출력할수 있어요. %d %s", 312, "하하하 호호호");
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
